Revit 2024 API
IExportContext2D.OnElementEnd2D Method
 This method marks the end of an element being exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
void OnElementEnd2D(
	ElementNode node
)
Visual Basic
Sub OnElementEnd2D ( _
	node As ElementNode _
)
Visual C++
void OnElementEnd2D(
	ElementNode^ node
)
Parameters
node
Type: Autodesk.Revit.DB.ElementNode
 An output node that represents an element.
Remarks
 For views having non-Wireframe display style, geometry of elements is output outside of view, instance and link begin/end brackets. Therefore the argument to this method is ElementNode that has both element ID and the host document.
See Also
IExportContext2D Interface
Autodesk.Revit.DB Namespace